Revit 2027 API
BuiltInFailures.DividedSurfaceFailures.DividedSurfaceMultipleIntersBetweenOppositeVirtualGrids Property
 There are multiple intersections between splitting chain of virtual splitters defined by these elements and so one of the virtual splitters will be ignored
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DividedSurfaceMultipleIntersBetweenOppositeVirtualGrids { get; }
Public Shared ReadOnly Property DividedSurfaceMultipleIntersBetweenOppositeVirtualGrids As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DividedSurfaceMultipleIntersBetweenOppositeVirtualGrids {
	FailureDefinitionId^ get ();
}
static member DividedSurfaceMultipleIntersBetweenOppositeVirtualGrids : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DividedSurfaceFailures Class
Autodesk.Revit.DB Namespace